Repository: yousefhmza/serr
Catalog: lib/l10n/app_*.arb
Languages: ar

# language
source: English
ar: العربية

source: Yes
ar: نعم

source: No
ar: لا

source: Ok
ar: حسنا

source: Skip
ar: إلغاء

# error
source: An error occurred! Try again.
ar: حدث خطأ ! حاول مجددا.

source: send
ar: إرسال

source: Upload
ar: تأكيد

source: Register
ar: تسجيل

source: Login
ar: دخول

# email
source: E-Mail address
ar: البريد الألكتروني

source: Username
ar: اسم المستخدم

source: Password
ar: كلمة المرور

# validatorE
source: Not valid E-Mail address!
ar: البريد الألكتروني غير صالح !

# validatorU
source: Please enter a username!
ar: برجاء إدخال اسم !

# validatorP
source: Password must be more than 8 characters!
ar: يجب أن تزيد كلمة المرور عن 8 أحرف !

# noAccount
source: Don't have an account?
ar: لا تمتلك حساب ؟

# haveAccount
source: Already have an account?
ar: تمتلك حساب بالفعل ؟

# bottomTap1
source: Recent
ar: الأحدث

# bottomTap2
source: Messages
ar: الرسائل

# bottomTap3
source: More
ar: المزيد

# topTap1
source: Received
ar: المستلمة

# topTap2
source: Favourite
ar: المفضلة

# topTap3
source: Sent
ar: المرسلة

# title1
source: Recent - serr
ar: الأحدث - سر

# title2
source: Messages - Serr
ar: الرسائل - سر

# title3
source: More - Serr
ar: المزيد - سر

# searchText
source: Search
ar: بحث

# mfProfile
source: Profile
ar: الملف الشخصي

# mfLanguage
source: Language
ar: اللغة

# mfDarkTheme
source: Dark theme
ar: ألوان مظلمة

# mfContactUs
source: Contact us
ar: تواصل معنا

# mfRateTheApp
source: Rate The App
ar: تقييم التطبيق

# mfShareTheApp
source: Share The App
ar: مشاركة التطبيق

# mfPrivacyPolicy
source: Privacy policy
ar: سياسة الخصوصية

# mfLogOut
source: Log out
ar: تسجيل الخروج

# noProfile
source: You are not registered! Please register to access your profile.
ar: أنت غير مسجل ! برجاء تسجيل الدخول للوصول إلي حسابك.

# noFeatures
source: You are not registered! Please register to use all app features.
ar: أنت غير مسجل ! برجاء تسجيل الدخول للحصول علي كل مزايا التطبيق.

# logoutCheck
source: Do you want to logout?
ar: هل ترغب في تسجيل الخروج ؟

# deleteCheck
source: Do you want to delete this message?
ar: هل ترغب في حذف هذه الرسالة ؟

# deleteCheck2
source: Do you want to delete this comment?
ar: هل ترغب في حذف هذا التعليق ؟

# notRegistered
source: You are not registered already!
ar: أنت غير مسجل بالفعل !

# googleSignIn
source: Sign up with google
ar: التسجيل باستخدام حساب جوجل

source: edit name
ar: تغيير الأسم

# editProfilePic
source: edit profile picture
ar: تغيير صورة الحساب

source: Public messages
ar: الرسائل الظاهرة للعامة

# noPublicMessages
source: You have no public messages!
ar: ليس لديك أي رسائل للعامة بعد !

# noPublicMessagesLS
source: This user doesn't have public messages!
ar: ليس لدي هذا المستخدم أي رسائل عامة !

# newName
source: Write a new name
ar: أكتب إسم جديد

# noMessages
source: You are not registered! Please register to send and receive messages.
ar: أنت غير مسجل ! برجاء تسجيل الدخول لتتمكن من إرسال و إستلام الرسائل.

# noSentMessages
source: No Sent messages yet!
ar: ليس هناك أي رسائل مرسلة بعد !

# noReceivedMessages
source: No received messages yet!
ar: ليس هناك أي رسائل مستلمة بعد !

# noFavouriteMessages
source: No favourite messages yet!
ar: ليس هناك أي رسائل مفضلة بعد !

# setFavError
source: An error occurred on setting favourite! try again.
ar: حدث خطأ ما أثناء تسجيل الرساله في المفضلة ! حاول مجددا.

# deleteMessageError
source: An error occurred on deleting the message! try again.
ar: حدث خطأ ما أثناء حذف الرسالة ! حاول مجددا.

# commentError
source: An error occurred on sending the comment! try again.
ar: حدث خطأ ما أثناء إرسال التعليق! حاول مجددا.

# validatorLS
source: Message must be more than 5 characters!
ar: يجب أن تزيد الرسالة عن 5 أحرف !

# commentValidator
source: Please enter your comment!
ar: برجاء كتابة تعليقك !

# enterMessageLS
source: Enter your message.
ar: أدخل رسالتك.

# enterComment
source: Enter your comment.
ar: أدخل تعليقك.

source: Edit comment
ar: تعديل التعليق

source: Delete comment
ar: حذف التعليق

source: Sent to
ar: مرسلة إلي

source: favourite
ar: مفضلة

source: delete
ar: حذف

source: share
ar: مشاركة

source: comment
ar: تعليق

source: Show public
ar: إظهار للعامة

source: Contact us
ar: تواصل معنا

# feedback
source: Send us your feedback and our team will get back to you within 24 hours.
ar: أرسل انطباعك لنا و سنقوم بالرد عليك خلال 24 ساعة.

# facebook
source: Serr on facebook
ar: صفحتنا علي فيسبوك

# insta
source: Serr on instagram
ar: صفحتنا علي انستجرام

# gmail
source: Contact us on gmail
ar: تواصل معنا عبر Gmail
